MiguelCigano/stm32_init_lab/uart_ucpp_01_f411/Src/main.cpp
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2026 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */


#include "stm32f4xx.h"
#include <iostream>

typedef uint32_t ui32;
typedef uint16_t ui16;
typedef  uint8_t  ui8;

#define SYS_FREQ 		16000000
#define APB1_CLK 		SYS_FREQ

#define UART_BAUDRATE 	115200

#define GPIOAEN		(1U <<  0)
#define UART2EN 	(1U << 17)

#define CR1_TE 		(1U <<  3)
#define CR1_UE		(1U << 13)

#define SR_TXE		(1U <<  7)


static void uart_set_baudrate(USART_TypeDef *USARTx, ui32 PeriphClk, ui32 BaudRate);
static ui16 compute_uart_baudrate(ui32 PeriphClk, ui32 BaudRate);
void uart2_tx_init(void);
void uart2_write(int ch);

void uart2_tx_init()
{
	// Configure UART GPIO pin
	// -- Enable clock access to GPIOA
	RCC->AHB1ENR |= GPIOAEN;

	// -- Set PA2 mode to alternate function mode
	GPIOA->MODER &= ~(1U << 4);	  // MODER2[ _ : 0 ]
	GPIOA->MODER |=  (1U << 5);   // MODER2[ 1 : _ ]

	// -- Set PA2 alternate function type to UART_TX (AF7)
	GPIOA->AFR[0] |=  (1U <<  8);   // AFRL2[ _ : _ : _ : 1 ]
	GPIOA->AFR[0] |=  (1U <<  9);   // AFRL2[ _ : _ : 1 : _ ]
	GPIOA->AFR[0] |=  (1U << 10);   // AFRL2[ _ : 1 : _ : _ ]
	GPIOA->AFR[0] &= ~(1U << 11);	// AFRL2[ 0 : _ : _ : _ ]

	// Configure UART module
	// -- Enable clock access to UART2
	RCC->APB1ENR |= UART2EN;

	// -- Configure Baud-Rate
	uart_set_baudrate(USART2, APB1_CLK, UART_BAUDRATE);

	// -- Configure Transfer Direction
	USART2->CR1 = CR1_TE;

	// -- Enable UART module
	USART2->CR1 |= CR1_UE;
}

void delay(volatile ui32 count)
{
    while(count--);
}

static void uart_set_baudrate(USART_TypeDef *USARTx, ui32 PeriphClk, ui32 BaudRate)
{
	USARTx->BRR = compute_uart_baudrate(PeriphClk, BaudRate);
}

static ui16 compute_uart_baudrate(ui32 PeriphClk, ui32 BaudRate)
{
	return ( (PeriphClk + (BaudRate / 20)) / BaudRate );
}

void uart2_write(int ch)
{
	// Make sure the transmit data register is empty
	while (!(USART2->SR & SR_TXE)) {}

	// Write to transmit data  register
	USART2->DR = (ch & 0xFF);
}

int main(void)
{
    // Enable clock to GPIOA and GPIOC
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN; // LED
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOCEN; // Button

    // Set PA5 like output (LED)
    GPIOA->MODER &= ~(3U << (5 * 2));   // Clear bits
    GPIOA->MODER |=  (1U << (5 * 2));   // 01 = Output

    GPIOA->OTYPER  &= ~(1U << 5);        // Push-pull
    GPIOA->OSPEEDR |=  (3U << (5 * 2));  // High Speed
    GPIOA->PUPDR   &= ~(3U << (5 * 2));   // Within pull


    GPIOC->MODER &= ~(3U << (13 * 2));  // 00 = Input
    GPIOC->PUPDR &= ~(3U << (13 * 2));  // Within pull (resistor in board)

    uart2_tx_init();
    std::string traffic_light_states = "red,green,OKK";
    std::string traffic_light_states2 = "green,red,STOP";

    while (true)
    {

    	for (const char& c : traffic_light_states) {
			uart2_write(c);
		}
    	uart2_write('\r');
    	uart2_write('\n');

    	delay(911100);


    	for (const char& c : traffic_light_states2) {
			uart2_write(c);
		}
    	uart2_write('\r');
		uart2_write('\n');

		delay(911100);
    }
}
